###### Download MySQL Python connector library
!pip install mysql-connector-python

# Making connection with MySQL Server

In [1]:
# Import library
import mysql.connector

----
To make connection with MySQL server we have to use the **`connect()`** method. We have to provide the -
- MySQL server location
- Username
- Password of user


-----

In [2]:
# Make connection object
db_conn = mysql.connector.connect(
                                    host="localhost",
                                    user="aniruddha",
                                    password="Abc@123"
                                )

In [3]:
# Connection object
print(db_conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x7f5b30299d68>

----
Create a cursor which will implement SQL commands on the database. It is created using the **`cursor()`** method.

----

In [4]:
# Create cursor object
cursor = db_conn.cursor()

In [5]:
# Cursor object 
cursor

---
To execute SQL queries, we have to use **`execute()`** method of the cursor object.

---

In [6]:
# Execute sql query
cursor.execute("show databases")

---
To fetch all the records from the output of an executed SQL query, we have to use **`fetchall()`** method of the cursor object.

---

In [7]:
# Fetch the result of the executed query
cursor.fetchall()

[('DEMO',),
 ('JobPortal',),
 ('company',),
 ('fifa19',),
 ('hr_db',),
 ('information_schema',),
 ('movies',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sql_hack',),
 ('sys',)]

---
Use database.

---

In [8]:
# use database
cursor.execute("use DEMO")

----
Show tables in a database.

---

In [9]:
# show tables
cursor.execute("show tables")
cursor.fetchall()

[('UserDetails',), ('emp',), ('sales',), ('t1',), ('t2',)]

---
To close the current cursor object, we use the **`close()`** method of the cursor object.

----

In [10]:
# Close cursor
cursor.close()

True

----
To close the connection with the database, we have to use the **`close()`** method of the database connection object.

----

In [11]:
# Close database connection
db_conn.close()

----
We can even use a specific database directly while creating a connection with the MySQL server. This will skip the *`use <database_name>`* step that we have to implement to start working with a database.

----

In [12]:
# Connecting with `DEMO` database
db_conn = mysql.connector.connect(
                                    host="localhost",
                                    user="aniruddha",
                                    password="Abc@123",
                                    database="DEMO"
                                )

In [13]:
# Create cursor 
cursor = db_conn.cursor()

In [14]:
# Show tables
cursor.execute("show tables")
cursor.fetchall()

[('UserDetails',), ('emp',), ('sales',), ('t1',), ('t2',)]

In [15]:
# Close cursor
cursor.close()

True

In [16]:
# Close database connection
db_conn.close()

# Implementing basic SQL commands with connector

In [17]:
# Connecting with `DEMO` database
db_conn = mysql.connector.connect(
                                    host="localhost",
                                    user="aniruddha",
                                    password="Abc@123",
                                    database="DEMO"
                                )

In [18]:
# Create cursor 
cursor = db_conn.cursor()

In [19]:
# Show tables
cursor.execute("show tables")
cursor.fetchall()

[('UserDetails',), ('emp',), ('sales',), ('t1',), ('t2',)]

### Retrieving records from a table

In [20]:
# Retrieve records from `sales` table
cursor.execute("select * from sales")

In [21]:
# Fetch records from executed query
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.date(2020, 9, 12), 2),
 (2, 'Julie', 'Headphone', datetime.date(2020, 9, 12), 1),
 (3, 'Crystal', 'Speaker', datetime.date(2020, 9, 12), 3)]

In [22]:
# Retrieve records from `sales` table
cursor.execute("select * from sales where quantity > 1")
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.date(2020, 9, 12), 2),
 (3, 'Crystal', 'Speaker', datetime.date(2020, 9, 12), 3)]

### Inserting records into a table

In [23]:
# Insert records
cursor.execute("insert into sales values(4, 'Daniel', 'Laptop', '2020-10-11', 3)")

In [24]:
# Retrieve records
cursor.execute("select * from sales")
cursor.fetchall()

[(1, 'Harry', 'Iphone', datetime.date(2020, 9, 12), 2),
 (2, 'Julie', 'Headphone', datetime.date(2020, 9, 12), 1),
 (3, 'Crystal', 'Speaker', datetime.date(2020, 9, 12), 3),
 (4, 'Daniel', 'Laptop', datetime.date(2020, 10, 11), 3)]

---
To commint the changes to the database, we have to use the **`commit()`** method of the database conneciton object.

----

*Check database from mysql shell.*

In [25]:
# Commit changes to database
db_conn.commit()

*Now check the updated database from MySQL shell.*

----
### Insert multiple records into a table

----

In [26]:
# Records 
data = [(5, 'Niel', 'Headphone', '2020-10-12', 1),
        (6, 'Simran', 'Monitor', '2020-10-12', 1)]

In [27]:
# Insert query. Specify parameter using %s
stmt = "insert into sales values(%s, %s, %s, %s, %s)"

----
To insert multiple records together, we have to use the **`executemany()`** method of the cursor object. 

It takes a query and a set of parameters. It implements the query with all the parameters. 

---

In [28]:
# Insert multiple records
cursor.executemany(stmt, data)

In [ ]:
### Fetch records
cursor.execute("select * from sales")
cursor.fetchall()

### Updating records in a table

In [30]:
# Update record
cursor.execute("update sales set name='Tom' where name='Harry'")

In [31]:
# Retrieve records
cursor.execute("select * from sales where name='Tom'")
cursor.fetchall()

[(1, 'Tom', 'Iphone', datetime.date(2020, 9, 12), 2)]

### Deleting records from a table

In [32]:
# Update record
cursor.execute("delete from sales where name='Tom'")

In [33]:
# Retrieve records
cursor.execute("select * from sales where name='Tom'")
cursor.fetchall()

[]

In [34]:
# Commit changes
db_conn.commit()

---
Similarly all the other SQL commands can be implemented using MySQL Python connector.

----

### SQL into Pandas DataFrame

In [35]:
# Connecting with `DEMO` database
db_conn = mysql.connector.connect(
                                    host="localhost",
                                    user="aniruddha",
                                    password="Abc@123",
                                    database="DEMO"
                                )

In [36]:
# Create cursor 
cursor = db_conn.cursor()

In [37]:
# Import pandas
import pandas as pd

In [38]:
# Execute statement
cursor.execute("select * from sales")

# Fetch result
data = cursor.fetchall()

In [39]:
# Convert result to pandas dataframe
df = pd.DataFrame.from_records(data, columns=['id',
                                              'name',
                                              'product',
                                              'sale_date',
                                              'quantity'])

In [40]:
df.head()

   id     name    product   sale_date  quantity
0   2    Julie  Headphone  2020-09-12         1
1   3  Crystal    Speaker  2020-09-12         3
2   4   Daniel     Laptop  2020-10-11         3
3   5     Niel  Headphone  2020-10-12         1
4   6   Simran    Monitor  2020-10-12         1

### Pandas DataFrame to SQL

In [41]:
df

   id     name    product   sale_date  quantity
0   2    Julie  Headphone  2020-09-12         1
1   3  Crystal    Speaker  2020-09-12         3
2   4   Daniel     Laptop  2020-10-11         3
3   5     Niel  Headphone  2020-10-12         1
4   6   Simran    Monitor  2020-10-12         1

In [42]:
# Function to convert dataframe records to tuples
def to_records(df):
   
    # list to store records as tuples
    list_records = []
    
    # Converting each dataframe record to tuple
    for row in df.to_records(index=False):
        # Appending record tuple to a list
        list_records.append(tuple((int(row[0]),row[1],row[2],row[3], int(row[4]))))
    
    # Return the list of tuples
    return list_records

In [43]:
# Convert dataframe records to list of tuples
output_result = to_records(df)

In [44]:
output_result

[(2, 'Julie', 'Headphone', datetime.date(2020, 9, 12), 1),
 (3, 'Crystal', 'Speaker', datetime.date(2020, 9, 12), 3),
 (4, 'Daniel', 'Laptop', datetime.date(2020, 10, 11), 3),
 (5, 'Niel', 'Headphone', datetime.date(2020, 10, 12), 1),
 (6, 'Simran', 'Monitor', datetime.date(2020, 10, 12), 1)]

In [45]:
# Create a new table
cursor.execute('''create table sales_2(id int, 
                                       name varchar(20), 
                                       product varchar(20),
                                       sale_date date,
                                       quantity int)''')

In [46]:
# SQL query statement
stmt = '''INSERT INTO sales_2(id, name, product, sale_date, quantity) 
             values(%s, %s, %s, %s, %s)'''

# Execute query
cursor.executemany(stmt, output_result)

In [47]:
# Retrieve 
cursor.execute("select * from sales_2")
cursor.fetchall()

[(2, 'Julie', 'Headphone', datetime.date(2020, 9, 12), 1),
 (3, 'Crystal', 'Speaker', datetime.date(2020, 9, 12), 3),
 (4, 'Daniel', 'Laptop', datetime.date(2020, 10, 11), 3),
 (5, 'Niel', 'Headphone', datetime.date(2020, 10, 12), 1),
 (6, 'Simran', 'Monitor', datetime.date(2020, 10, 12), 1)]

In [48]:
cursor.close()

True

In [49]:
db_conn.commit()